#1 Напишите и запустите программу. которая выводит строку  "Hello world!"
print('---------------Task 1----------------')
print('Hello, world!')
#2 Напишите программу, которая на входе получает имя пользователя, cохраняет его
# в переменную user_name и выводит строку "Hello {user_name}!"
print('---------------Task 2----------------')
name = input('Please, enter user name: ')
print('Hello, ' + name + '!')
print(f"Hello, {name}!")
print("Hello, {}!".format(name))
#3 Напишите программу, которая на входе получает 2 числа, производит с ними арифметическую
#операцию (на ваше усмотрение), и выводит “Результат = {результат}”.
print('---------------Task 3----------------')
a = int(input('Enter number 1: '))
b = int(input('Enter number 2: '))
print("Результат сложения = ", a + b)
#4 Напишите программу, чтобы вывести:
#** ** ** ** *
#* *
#* *
#** ** ** ** *
print('---------------Task 4. Способ 1----------------')
print("** ** ** ** *")
print("* *")
print("* *")
print("** ** ** ** *")

print('---------------Task 4. Способ 2----------------')
print("** ** ** ** *\n* *\n* *\n** ** ** ** *")

print('---------------Task 4. Способ 3----------------')
print("""** ** ** ** *
* *
* *
** ** ** ** *""")